#define あ 1
#define い 2
#define う 3
#define え 4
#define お 5
#define か 6
#define き 7
#define く 8
#define け 9
#define こ 10
#define さ 11
#define し 12
#define す 13
#define せ 14
#define そ 15
#define た 16
#define ち 17
#define つ 18
#define て 19
#define と 20
#define な 21
#define に 22
#define ぬ 23
#define ね 24
#define の 25
#define は 26
#define ひ 27
#define ふ 28
#define へ 29
#define ほ 30
#define ま 31
#define み 32
#define む 33
#define め 34
#define も 35
#define や 36
#define ゆ 37
#define よ 38
#define ら 39
#define り 40
#define る 41
#define れ 42
#define ろ 43
#define わ 44
#define を 45
#define ん 46
#define CHAR_SPC 47
#define が 48
#define ぎ 49
#define ぐ 50
#define げ 51
#define ご 52
#define ざ 53
#define じ 54
#define ず 55
#define ぜ 56
#define ぞ 57
#define だ 58
#define ぢ 59
#define づ 60
#define で 61
#define ど 62
#define ば 63
#define び 64
#define ぶ 65
#define べ 66
#define ぼ 67
#define ぱ 68
#define ぴ 69
#define ぷ 70
#define ぺ 71
#define ぽ 72
#define ぁ 73
#define ぃ 74
#define ぅ 75
#define ぇ 76
#define ぉ 77
#define ゃ 78
#define ゅ 79
#define ょ 80
#define っ 81
#define ー 82
#define ア 83
#define イ 84
#define ウ 85
#define エ 86
#define オ 87
#define カ 88
#define キ 89
#define ク 90
#define ケ 91
#define コ 92
#define サ 93
#define シ 94
#define ス 95
#define セ 96
#define ソ 97
#define タ 98
#define チ 99
#define ツ 100
#define テ 101
#define ト 102
#define ナ 103
#define 二 104
#define ヌ 105
#define ネ 106
#define ノ 107
#define ハ 108
#define ヒ 109
#define フ 110
#define ヘ 111
#define ホ 112
#define マ 113
#define ミ 114
#define ム 115
#define メ 116
#define モ 117
#define ヤ 118
#define ユ 119
#define ヨ 120
#define ラ 121
#define リ 122
#define ル 123
#define レ 124
#define ロ 125
#define ワ 126
#define ヲ 127
#define ン 128
#define ヴ 129
#define ガ 130
#define ギ 131
#define グ 132
#define ゲ 133
#define ゴ 134
#define ザ 135
#define ジ 136
#define ズ 137
#define ゼ 138
#define ゾ 139
#define ダ 140
#define ヂ 141
#define ヅ 142
#define デ 143
#define ド 144
#define バ 145
#define ビ 146
#define ブ 147
#define ベ 148
#define ボ 149
#define パ 150
#define ピ 151
#define プ 152
#define ペ 153
#define ポ 154
#define ァ 155
#define ィ 156
#define ゥ 157
#define ェ 158
#define ォ 159
#define ャ 160
#define ュ 161
#define ョ 162
#define ッ 163
#define CHAR_0 164
#define CHAR_1 165
#define CHAR_2 166
#define CHAR_3 167
#define CHAR_4 168
#define CHAR_5 169
#define CHAR_6 170
#define CHAR_7 171
#define CHAR_8 172
#define CHAR_9 ('9' + 0x100)
// 00AE=～
// 00AF=A
// 00B0=B
// 00B1=C
// 00B2=D
// 00B3=E
// 00B4=F
// 00B5=G
// 00B6=H
// 00B7=I
// 00B8=J
// 00B9=K
// 00BA=L
// 00BB=M
// 00BC=N
// 00BD=O
// 00BE=P
// 00BF=Q
// 00C0=R
// 00C1=S
// 00C2=T
// 00C3=U
// 00C4=V
// 00C5=W
// 00C6=X
// 00C7=Y
// 00C8=Z
// 00C9=！
// 00CA=？
// 00CB=＋
// 00CC=-
// 00CD=*
// 00CE=・
// 00CF=…
// 00D0=♂
// 00D1=♀
// 00D2=￥
// 00D3==
// 00D4=&
// 00D5=<
// 00D6=>
// 00D7=%
// 00D8='
// 00D9=。
// 00DA=、
// 00DB=［
// 00DC=］
// 00DD=：
// 00DE=；
// 00DF=（
// 00E0=）
// 00E1=.
// 00E2="
// 00E3=♪
// 00E4=@
// 00E5=$
// 00E6=#
// 00E7=「
// 00E8=」
// 00E9=『
// 00EA=』
// 00EB=M
// 00EC=＿
// 00ED=魔
// 00EE=神
// 00EF=女
// 00F0=天
// 00F1=鬼
// 00F2=使
// 00F3=龍
// 00F4=霊
// 00F5=鳥
// 00F6=獣
// 00F7=聖
// 00F8=精
// 00F9=妖
// 00FA=夜
// 00FB=堕
// 00FC=闘
// 00FD=地
// 00FE=人
// 00FF=教
// 0100=徒
// 0101=邪
// 0102=王
// 0103=凶
// 0104=幽
// 0105=悪
// 0106=屍
// 0107=外
// 0108=道
// 0109=超
// 010A=合
// 010B=体
// 010C=剣
// 010D=不
// 010E=可
// 010F=能
// 0110=死
// 0111=呪
// 0112=幸
// 0113=歌
// 0114=子
// 0115=守
// 0116=毒
// 0117=電
// 0119=水
// 011B=炎
// 011C=嚙
// 011F=石
// 0120=化
// 0121=魅
// 0122=惑
// 0123=引
// 0124=搔
// 0125=針
// 0126=羽
// 0127=九
// 0128=十
// 0129=当
// 012A=巻
// 012C=押
// 012D=滑
// 012E=必
// 012F=殺
// 0130=会
// 0131=心
// 0132=逃
// 0133=仲
// 0134=間
// 0135=呼
// 0136=/
// 0137=赤
// 0138=青
// 0139=練
// 013A=気
// 013B=風
// 013C=雷
// 013D=火
// 013E=草
// 013F=薙
// 0140=布
// 0141=都
// 0142=御
// 0144=曇
// 0145=模
// 0146=造
// 0147=刀
// 0148=無
// 0149=銘
// 014A=三
// 014B=節
// 014C=根
// 014D=備
// 014E=前
// 014F=短
// 0150=虎
// 0151=鉄
// 0152=色
// 0153=長
// 0154=日
// 0155=月
// 0156=太
// 0157=光
// 0158=小
// 0159=紅
// 015A=蓮
// 015B=船
// 015C=独
// 015D=鈷
// 015E=杵
// 015F=七
// 0160=星
// 0161=飛
// 0162=行
// 0163=菊
// 0164=冥
// 0165=土
// 0166=産
// 0167=首
// 0168=刈
// 0169=尾
// 016A=沼
// 016B=矛
// 016C=八
// 016D=束
// 016E=覇
// 016F=府
// 0170=破
// 0171=鐘
// 0173=扇
// 0175=門
// 0176=俱
// 0177=利
// 0178=伽
// 0179=羅
// 017A=砲
// 017B=黄
// 017C=金
// 017D=銃
// 017E=国
// 017F=友
// 0180=通
// 0181=常
// 0182=弾
// 0183=経
// 0184=丸
// 0185=銀
// 0186=力
// 0187=封
// 0188=閃
// 0189=闇
// 018A=角
// 018B=帽
// 018C=喰
// 018D=兜
// 018E=立
// 018F=和
// 0190=恵
// 0191=輪
// 0192=緊
// 0193=箍
// 0194=導
// 0195=士
// 0196=影
// 0197=紐
// 0198=諏
// 0199=訪
// 019A=法
// 019B=性
// 019C=鎧
// 019D=衣
// 019E=漆
// 019F=黒
// 01A0=白
// 01A1=篭
// 01A2=手
// 01A3=武
// 01A4=者
// 01A5=具
// 01A6=足
// 01A7=傷
// 01A8=藥
// 01A9=牛
// 01AA=丹
// 01AB=宝
// 01AC=玉
// 01AD=反
// 01AE=魂
// 01AF=香
// 01B0=強
// 01B1=智
// 01B2=速
// 01B3=運
// 01B4=返
// 01B5=矢
// 01B6=獄
// 01B7=秘
// 01B8=孔
// 01B9=阿
// 01BA=修
// 01BB=挙
// 01BC=施
// 01BD=餓
// 01BE=米
// 01BF=患
// 01C0=皿
// 01C1=煙
// 01C3=如
// 01C4=来
// 01C5=像
// 01C6=弥
// 01C7=陀
// 01C8=数
// 01C9=珠
// 01CA=鈴
// 01CB=脇
// 01CC=見
// 01CD=壺
// 01CE=免
// 01CF=罪
// 01D0=符
// 01D1=偽
// 01D2=亀
// 01D3=甲
// 01D4=蛸
// 01D5=笛
// 01D6=爪
// 01D7=牙
// 01D8=四
// 01D9=札
// 01DA=攻
// 01DB=命
// 01DC=中
// 01DD=防
// 01DE=回
// 01E1=効
// 01E2=果
// 01E3=耐
// 01E5=焼
// 01E6=版
// 01E7=全
// 01E8=凍
// 01E9=結
// 01EA=落
// 01EB=一
// 01EC=状
// 01ED=態
// 01EE=衝
// 01EF=波
// 01F0=糸
// 01F1=最
// 01F2=大
// 01F3=与
// 01F4=属
// 01F5=即
// 01F6=吸
// 01F7=収
// 01F8=下
// 01F9=率
// 01FA=味
// 01FB=方
// 01FC=上
// 01FD=直
// 01FE=接
// 01FF=少
// 0200=復
// 0201=以
// 0202=軽
// 0203=異
// 0204=低
// 0205=確
// 0206=用
// 0207=探
// 0208=他
// 0209=周
// 020A=囲
// 020B=表
// 020C=示
// 020D=新
// 020E=切
// 020F=脱
// 0210=出
// 0211=進
// 0212=入
// 0213=点
// 0214=戻
// 0215=終
// 0216=戦
// 0217=主
// 0218=公
// 0219=現
// 021A=抑
// 021B=召
// 021C=喚
// 021D=男
// 021E=氷
// 021F=張
// 0220=放
// 0221=突
// 0222=程
// 0223=度
// 0224=倍
// 0225=副
// 0226=作
// 0227=完
// 0228=失
// 0229=敗
// 022A=員
// 022B=昇
// 022C=多
// 022D=消
// 022E=去
// 022F=後
// 0230=壊
// 0231=場
// 0232=時
// 0233=身
// 0234=代
// 0235=対
// 0236=在
// 0237=階
// 0238=層
// 0239=自
// 023A=分
// 023B=次
// 023C=満
// 023D=込
// 023E=増
// 023F=減
// 0240=店
// 0241=交
// 0242=識
// 0243=別
// 0244=宿
// 0246=印
// 0247=街
// 0248=館
// 0249=名
// 024A=井
// 024B=頭
// 024C=園
// 024D=旧
// 024E=視
// 024F=庁
// 0250=剛
// 0251=界
// 0252=座
// 0253=西
// 0254=北
// 0255=口
// 0256=東
// 0257=南
// 0258=研
// 0259=究
// 025A=所
// 025B=広
// 025C=目
// 025D=市
// 025E=ヶ
// 025F=谷
// 0260=駐
// 0261=屯
// 0262=持
// 0263=宅
// 0264=渋
// 0265=野
// 0266=世
// 0267=池
// 0268=袋
// 0269=六
// 026A=本
// 026B=木
// 026C=右
// 026D=左
// 026E=処
// 026F=刑
// 0270=京
// 0271=毘
// 0272=沙
// 0273=病
// 0274=院
// 0275=品
// 0276=川
// 0277=隣
// 0278=医
// 0279=家
// 027A=連
// 027B=絡
// 027C=路
// 027D=様
// 027E=今
// 027F=血
// 0280=飢
// 0281=何
// 0282=言
// 0283=胸
// 0284=話
// 0285=俺
// 0286=差
// 0287=笑
// 0288=吾
// 0289=輩
// 028A=岩
// 028B=素
// 028C=砕
// 028D=同
// 028E=事
// 028F=試
// 0290=奴
// 0291=等
// 0292=誰
// 0293=思
// 0294=聞
// 0295=勢
// 0296=初
// 0297=望
// 0298=馬
// 0299=鹿
// 029A=遅
// 029B=送
// 029C=欲
// 029D=徂
// 029E=服
// 029F=止
// 02A0=礼
// 02A1=悔
// 02A2=声
// 02A3=吠
// 02A4=眼
// 02A5=鋭
// 02A6=捉
// 02A7=族
// 02A8=私
// 02A9=恐
// 02AA=臆
// 02AB=怖
// 02AC=帰
// 02AD=愚
// 02AE=暇
// 02AF=我
// 02B0=高
// 02B1=貴
// 02B2=決
// 02B3=安
// 02B4=物
// 02B5=受
// 02B6=取
// 02B7=申
// 02B8=契
// 02B9=約
// 02BA=成
// 02BB=戒
// 02BC=怒
// 02BD=弱
// 02BE=際
// 02BF=先
// 02C0=汚
// 02C1=郎
// 02C2=閉
// 02C3=至
// 02C4=快
// 02C5=楽
// 02C6=祭
// 02C7=渡
// 02C8=承
// 02C9=穢
// 02CA=背
// 02CB=信
// 02CC=拒
// 02CD=否
// 02CE=断
// 02CF=恪
// 02D0=吹
// 02D1=要
// 02D2=求
// 02D3=良
// 02D4=達
// 02D5=平
// 02D6=挑
// 02D7=発
// 02D8=駄
// 02D9=説
// 02DA=待
// 02DB=哺
// 02DC=虜
// 02DD=近
// 02DE=隙
// 02DF=踊
// 02E0=晩
// 02E1=猛
// 02E2=烈
// 02E3=睡
// 02E4=捕
// 02E5=眠
// 02E6=構
// 02E7=然
// 02E8=招
// 02E9=器
// 02EA=謝
// 02EB=乗
// 02EC=睨
// 02ED=答
// 02EE=握
// 02EF=追
// 02F0=払
// 02F1=好
// 02F2=的
// 02F3=圧
// 02F4=年
// 02F5=々
// 02F6=部
// 02F7=屋
// 02F8=犬
// 02F9=禁
// 02FA=厳
// 02FB=司
// 02FC=令
// 02FD=協
// 02FE=改
// 02FF=術
// 0300=容
// 0302=官
// 0303=千
// 0304=衛
// 0305=隊
// 0306=振
// 0307=貸
// 0308=助
// 0309=書
// 030A=訳
// 030B=加
// 030C=役
// 030D=設
// 030E=察
// 030F=酒
// 0310=飲
// 0311=意
// 0312=響
// 0313=皆
// 0314=元
// 0315=生
// 0316=願
// 0317=扉
// 0318=開
// 0319=伯
// 031A=爵
// 031B=了
// 031C=続
// 031D=写
// 031E=護
// 031F=便